// В умові завдання допущено помилку при n = 4 результатом має бути 8, а 13 при n = 5

// Підключення бібліотек
#include <stdio.h>
#include <windows.h>

// Оголошення функції для обрахунку кількості шуканих послідовностей
int countS(int n);

int main() {

    // Зміна кодування консолі на UTF-8
    SetConsoleCP(65001);
    SetConsoleOutputCP(65001);

    int n;
    printf("Введіть довжину послідовності n: ");
    scanf("%d", &n);

    printf("Кількість шуканих послідовностей: %d\n", countS(n));

    return 0;
}

// Функція для обрахунку кількості шуканих послідовностей
int countS(int n) {
    int count0 = 1; // Початкова кількість послідовностей з одним символом 0
    int count1 = 1; // Початкова кількість послідовностей з одним символом 1

    for (int i = 2; i <= n; i++) {
        int temp = count0; // Тимчасова змінна для збереження попереднього значення count0
        count0 = (count0 + count1) % 12345; // Обчислюємо нове значення count0
        count1 = temp; // Присвоюємо count1 попереднє значення count0
    }

    return (count0 + count1) % 12345; // Повертаємо кількість послідовностей
}
